src/main/profiling/wrkPost1Sharding.txt
Running 1m test @ http://localhost:8080
  4 threads and 250 connections
  Thread calibration: mean lat.: 2.468ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.712ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 7.165ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 2.434ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.95ms    8.01ms  54.02ms   86.08%
    Req/Sec   529.65    441.17     3.56k    73.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.57ms
 75.000%    9.15ms
 90.000%   18.50ms
 99.000%   35.97ms
 99.900%   48.70ms
 99.990%   53.18ms
 99.999%   53.95ms
100.000%   54.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.101     0.000000            1         1.00
       0.970     0.100000         9936         1.11
       1.365     0.200000        19885         1.25
       1.791     0.300000        29802         1.43
       2.389     0.400000        39741         1.67
       3.569     0.500000        49676         2.00
       4.435     0.550000        54653         2.22
       5.431     0.600000        59615         2.50
       6.519     0.650000        64578         2.86
       7.719     0.700000        69544         3.33
       9.151     0.750000        74516         4.00
      10.047     0.775000        76988         4.44
      11.151     0.800000        79489         5.00
      12.511     0.825000        81953         5.71
      14.167     0.850000        84445         6.67
      16.095     0.875000        86920         8.00
      17.247     0.887500        88170         8.89
      18.495     0.900000        89404        10.00
      19.791     0.912500        90658        11.43
      21.215     0.925000        91887        13.33
      23.103     0.937500        93131        16.00
      23.903     0.943750        93760        17.78
      24.799     0.950000        94383        20.00
      25.743     0.956250        94997        22.86
      26.991     0.962500        95618        26.67
      28.223     0.968750        96233        32.00
      29.007     0.971875        96546        35.56
      29.887     0.975000        96856        40.00
      30.783     0.978125        97165        45.71
      31.935     0.981250        97475        53.33
      33.439     0.984375        97787        64.00
      34.207     0.985938        97946        71.11
      35.007     0.987500        98098        80.00
      35.583     0.989062        98252        91.43
      36.351     0.990625        98406       106.67
      37.375     0.992188        98562       128.00
      38.079     0.992969        98638       142.22
      38.655     0.993750        98720       160.00
      39.327     0.994531        98794       182.86
      40.159     0.995313        98872       213.33
      41.023     0.996094        98948       256.00
      41.535     0.996484        98987       284.44
      42.527     0.996875        99026       320.00
      43.359     0.997266        99065       365.71
      44.095     0.997656        99105       426.67
      45.279     0.998047        99142       512.00
      46.015     0.998242        99162       568.89
      46.591     0.998437        99182       640.00
      47.263     0.998633        99202       731.43
      47.967     0.998828        99221       853.33
      48.703     0.999023        99239      1024.00
      48.863     0.999121        99249      1137.78
      49.247     0.999219        99259      1280.00
      49.919     0.999316        99270      1462.86
      50.143     0.999414        99278      1706.67
      50.655     0.999512        99288      2048.00
      50.815     0.999561        99293      2275.56
      51.103     0.999609        99298      2560.00
      51.487     0.999658        99303      2925.71
      51.775     0.999707        99307      3413.33
      52.063     0.999756        99313      4096.00
      52.607     0.999780        99315      4551.11
      52.767     0.999805        99317      5120.00
      52.959     0.999829        99320      5851.43
      53.023     0.999854        99322      6826.67
      53.151     0.999878        99325      8192.00
      53.183     0.999890        99326      9102.22
      53.247     0.999902        99327     10240.00
      53.407     0.999915        99329     11702.86
      53.407     0.999927        99329     13653.33
      53.567     0.999939        99330     16384.00
      53.631     0.999945        99331     18204.44
      53.663     0.999951        99332     20480.00
      53.663     0.999957        99332     23405.71
      53.695     0.999963        99333     27306.67
      53.695     0.999969        99333     32768.00
      53.759     0.999973        99334     36408.89
      53.759     0.999976        99334     40960.00
      53.759     0.999979        99334     46811.43
      53.951     0.999982        99335     54613.33
      53.951     0.999985        99335     65536.00
      53.951     0.999986        99335     72817.78
      53.951     0.999988        99335     81920.00
      53.951     0.999989        99335     93622.86
      54.047     0.999991        99336    109226.67
      54.047     1.000000        99336          inf
#[Mean    =        6.950, StdDeviation   =        8.010]
#[Max     =       54.016, Total count    =        99336]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  118931 requests in 1.00m, 9.41MB read
Requests/sec:   1981.30
Transfer/sec:    160.60KB