src/main/profiling/wrkPost2Sharding.txt
Running 1m test @ http://localhost:8080
  4 threads and 250 connections
  Thread calibration: mean lat.: 1576.972ms, rate sampling interval: 5193ms
  Thread calibration: mean lat.: 1506.859ms, rate sampling interval: 5017ms
  Thread calibration: mean lat.: 1293.890ms, rate sampling interval: 4997ms
  Thread calibration: mean lat.: 1393.737ms, rate sampling interval: 5349ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.71s     4.53s   19.71s    58.21%
    Req/Sec     5.09k   227.18     5.47k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.81s 
 75.000%   14.27s 
 90.000%   17.17s 
 99.000%   18.92s 
 99.900%   19.45s 
 99.990%   19.63s 
 99.999%   19.69s 
100.000%   19.73s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2656.255     0.000000            1         1.00
    4517.887     0.100000       101362         1.11
    5992.447     0.200000       202738         1.25
    7651.327     0.300000       304040         1.43
    9142.271     0.400000       405749         1.67
   10813.439     0.500000       506956         2.00
   11427.839     0.550000       557374         2.22
   12140.543     0.600000       608289         2.50
   12902.399     0.650000       658639         2.86
   13574.143     0.700000       709486         3.33
   14270.463     0.750000       759832         4.00
   14794.751     0.775000       785206         4.44
   15359.999     0.800000       810812         5.00
   15810.559     0.825000       835982         5.71
   16293.887     0.850000       861464         6.67
   16744.447     0.875000       886583         8.00
   16957.439     0.887500       899609         8.89
   17170.431     0.900000       912415        10.00
   17367.039     0.912500       924528        11.43
   17580.031     0.925000       937189        13.33
   17809.407     0.937500       950350        16.00
   17907.711     0.943750       956357        17.78
   18006.015     0.950000       962702        20.00
   18104.319     0.956250       969050        22.86
   18219.007     0.962500       976107        26.67
   18317.311     0.968750       981798        32.00
   18382.847     0.971875       985377        35.56
   18431.999     0.975000       988095        40.00
   18497.535     0.978125       991016        45.71
   18595.839     0.981250       994509        53.33
   18710.527     0.984375       997514        64.00
   18776.063     0.985938       999223        71.11
   18825.215     0.987500      1000532        80.00
   18890.751     0.989062      1002300        91.43
   18939.903     0.990625      1003695       106.67
   19005.439     0.992188      1005582       128.00
   19038.207     0.992969      1006370       142.22
   19070.975     0.993750      1007127       160.00
   19103.743     0.994531      1007690       182.86
   19152.895     0.995313      1008444       213.33
   19218.431     0.996094      1009343       256.00
   19234.815     0.996484      1009604       284.44
   19267.583     0.996875      1010019       320.00
   19300.351     0.997266      1010480       365.71
   19333.119     0.997656      1010946       426.67
   19349.503     0.998047      1011145       512.00
   19365.887     0.998242      1011331       568.89
   19398.655     0.998437      1011717       640.00
   19415.039     0.998633      1011893       731.43
   19431.423     0.998828      1012025       853.33
   19447.807     0.999023      1012145      1024.00
   19464.191     0.999121      1012296      1137.78
   19480.575     0.999219      1012457      1280.00
   19480.575     0.999316      1012457      1462.86
   19496.959     0.999414      1012600      1706.67
   19513.343     0.999512      1012693      2048.00
   19513.343     0.999561      1012693      2275.56
   19529.727     0.999609      1012756      2560.00
   19546.111     0.999658      1012818      2925.71
   19546.111     0.999707      1012818      3413.33
   19562.495     0.999756      1012884      4096.00
   19578.879     0.999780      1012942      4551.11
   19578.879     0.999805      1012942      5120.00
   19578.879     0.999829      1012942      5851.43
   19595.263     0.999854      1012977      6826.67
   19611.647     0.999878      1012991      8192.00
   19628.031     0.999890      1013007      9102.22
   19644.415     0.999902      1013024     10240.00
   19644.415     0.999915      1013024     11702.86
   19660.799     0.999927      1013057     13653.33
   19660.799     0.999939      1013057     16384.00
   19660.799     0.999945      1013057     18204.44
   19677.183     0.999951      1013086     20480.00
   19677.183     0.999957      1013086     23405.71
   19677.183     0.999963      1013086     27306.67
   19677.183     0.999969      1013086     32768.00
   19677.183     0.999973      1013086     36408.89
   19677.183     0.999976      1013086     40960.00
   19677.183     0.999979      1013086     46811.43
   19693.567     0.999982      1013101     54613.33
   19693.567     0.999985      1013101     65536.00
   19693.567     0.999986      1013101     72817.78
   19693.567     0.999988      1013101     81920.00
   19693.567     0.999989      1013101     93622.86
   19693.567     0.999991      1013101    109226.67
   19693.567     0.999992      1013101    131072.00
   19693.567     0.999993      1013101    145635.56
   19693.567     0.999994      1013101    163840.00
   19709.951     0.999995      1013103    187245.71
   19709.951     0.999995      1013103    218453.33
   19726.335     0.999996      1013107    262144.00
   19726.335     1.000000      1013107          inf
#[Mean    =    10713.260, StdDeviation   =     4532.259]
#[Max     =    19709.952, Total count    =      1013107]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1217989 requests in 1.00m, 96.41MB read
Requests/sec:  20302.88
Transfer/sec:      1.61MB